[{"Reviewer":"Amazon Customer","DateOfReview":"2018-10-31","Colour":" Silver ","Size":" 256GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Amazon Return support is too poor","ReviewDescription":"I purchased iphone X on 26th Oct'18 and started using from 28th Oct'18. When i received the product, it was already opened which i informed Amazon representative but i was told that it is original product and it will not have issue. Within two days, it started giving me issue with network & WiFi connectivity. I again contacted Amazon through app but i was directed to Apple support. After talking to Apple representative, i only got indefinite answer like it could be software issue and i should wait till it updates but Amazon return\/replace policy valid for only 10 days. After purchasing a phone worth up to 90k, i had to do all this and still no support from Amazon.","title_processed":"amazon return support poor","desc_processed":"purchase iphone x 26th oct18 start use 28th oct18 receive product already open inform amazon representative tell original product not issue within two day start give issue network wifi connectivity contact amazon app direct apple support talk apple representative get indefinite answer like could software issue wait till update amazon return replace policy valid 10 day purchase phone worth 90k still no support amazon","metaCorpus_processed":"amazon customer silver 256 gb amazon return support poor purchase iphone x 26th oct18 start use 28th oct18 receive product already open inform amazon representative tell original product not issue within two day start give issue network wifi connectivity contact amazon app direct apple support talk apple representative get indefinite answer like could software issue wait till update amazon return replace policy valid 10 day purchase phone worth 90k still no support amazon","Sentiment":-1.0},{"Reviewer":"ShowrobDa","DateOfReview":"2018-10-12","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"An amazing deal at INR 69,999\/-","ReviewDescription":"This is my 3rd iPhone after iPhone 4S and iPhone 6S Plus.Being an utter working middle class guy, I don't switch my iPhones very often (my android phones barely lasted me 9 months though). I do consider them extremely expensive, and I wouldn't go for one, unless I felt it was worth the money I was paying for it.Pros:- I got this phone for INR 69,999\/- from Amazon. With exchange offer, it cost me a little over 60K. For the price (and that price only), this makes it worth the buy.- It may not be the latest and greatest, but compared to iPhone XR, this is a much better package overall. Considering the XR is now priced higher than X. XS is only marginally better, and didn't feel it was worth the extra 30K.- Even after a year of being on the market, this phone is an absolute beast in terms of performance, especially after iOS 12.- The Camera is a beauty. You can't compare with DSLRs, but it is right up there with OnePlus and Google phones.- Looks exactly like the XS, and doesn't even have the S badging. So no one will be the wiser.Cons:- The delivery was a bit of a hassle. I had opted for One Day Delivery, at my work address. The agent reached at 7:30 in the morning, when I was obviously not at work. He did say he will come later in the afternoon. However, received the phone a day later.- The phone is extremely slippery. Invest in a good case, front screen protector and a rear glass protector- Such expensive phones should come with 128GB of storage as base, instead of 64GB. If you record 4K videos, it will eat up your storage really quickly.- Videos get heavily cropped when watching in full screen mode. If you have the money, go for XS Max.- The battery isn't the best. Takes over two hours to fully charge from 5% to 100% even with the iPad charger. With moderate usage, you can get 8 hours barely.- With the price of the phone, should have at least come with the fast charger in the box.","title_processed":"amazing deal inr 69999","desc_processed":"3rd iphone iphone 4s iphone 6s plus utter work middle class guy not switch iphone often android phone barely last 9 month though consider extremely expensive would not go one unless feel worth money pay pros get phone inr 69999 amazon exchange offer cost little 60k price price make worth buy may not late great compare iphone xr much good package overall consider xr price high x xs marginally good not feel worth extra 30k even year market phone absolute beast term performance especially ios 12 camera beauty not compare dslr right oneplus google phone look exactly like xs not even badging no one wise cons delivery bit hassle opt one day delivery work address agent reach 730 morning obviously not work say come later afternoon however receive phone day later phone extremely slippery invest good case front screen protector rear glass protector expensive phone come 128 gb storage base instead 64 gb record 4k video eat storage really quickly video get heavily crop watch full screen mode money go xs max battery not good take two hour fully charge 5 100 even ipad charger moderate usage get 8 hour barely price phone least come fast charger box","metaCorpus_processed":"showrobda space grey 64 gb amazing deal inr 69999 3rd iphone iphone 4s iphone 6s plus utter work middle class guy not switch iphone often android phone barely last 9 month though consider extremely expensive would not go one unless feel worth money pay pros get phone inr 69999 amazon exchange offer cost little 60k price price make worth buy may not late great compare iphone xr much good package overall consider xr price high x xs marginally good not feel worth extra 30k even year market phone absolute beast term performance especially ios 12 camera beauty not compare dslr right oneplus google phone look exactly like xs not even badging no one wise cons delivery bit hassle opt one day delivery work address agent reach 730 morning obviously not work say come later afternoon however receive phone day later phone extremely slippery invest good case front screen protector rear glass protector expensive phone come 128 gb storage base instead 64 gb record 4k video eat storage really quickly video get heavily crop watch full screen mode money go xs max battery not good take two hour fully charge 5 100 even ipad charger moderate usage get 8 hour barely price phone least come fast charger box","Sentiment":1.0},{"Reviewer":"Ktron","DateOfReview":"2018-10-11","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Amazing beast(iPhone X 256 GB) for discount!!","ReviewDescription":"Thanks to Appario Retail Private Ltd, I got this 256 GB beast during amazon great Indian sale for under 80k. Additionally received cash back of Rs.1000. On delivery, I checked at imei24 and apple site  (checkcoverage) for authenticity and warranty of the product. I was satisfied as the product was 100% genuine.iPhone is buttery smooth and the full screen is an awesome experience. Personally, I love the notch as it gives character to the phone. No matter how much you hate the design it seems this is quite an \"IN\" thing now for almost all phone manufacturers have started copying Apple. So all you detractors out there of Apple and the notch - take a chill pill :)!!Pros:1) A11 Bionic Processor is blazing fast and coupled with 3GB ram you will never have any issues with any of the heavy duty tasks you throw at it2) Screen resolution (Super retina HD) and the contrast ratio makes the viewing experience breathtaking3) Got the A1865 model ( iPhone X A1865 uses the Qualcomm MDM9655 Snapdragon X16 LTE modem while the iPhone X A1901 has the Intel XMM 7480 modem) which is better than the A1901 model as A1865 covers more cellular bands (GSM and CDMA networks and frequencies) and the performance of Qualcomm’s chips has always been better than Intel’s. LTE speeds and cellular receptions in case of weak signals also are a shade better than A1901.Cons:1) All glass body makes this susceptible to breakage. So recommend having a case around it (preferably a transparent one so that the beauty of the original phone can still be enjoyed!)2) I have to say that battery life is average - a shade better than iPhone 8.3) Additional touch id support would have been better as an alternative unlocking optionWill come up with a detailed review soon in a couple of weeks.","title_processed":"amazing beast iphone x 256 gb discount","desc_processed":"thank appario retail private ltd get 256 gb beast amazon great indian sale 80k additionally receive cash back rs 1000 delivery check imei24 apple site checkcoverage authenticity warranty product satisfied product 100 genuine iphone buttery smooth full screen awesome experience personally love notch give character phone no matter much hate design seem quite thing almost phone manufacturer start copy apple detractor apple notch take chill pill pros1 a11 bionic processor blaze fast couple 3 gb ram never issue heavy duty task throw it2 screen resolution super retina hd contrast ratio make view experience breathtaking3 get a1865 model iphone x a1865 use qualcomm mdm9655 snapdragon x16 lte modem iphone x a1901 intel xmm 7480 modem good a1901 model a1865 cover cellular band gsm cdma network frequency performance qualcomms chip always good intel lte speed cellular reception case weak signal also shade better a1901 cons1 glass body make susceptible breakage recommend case around preferably transparent one beauty original phone still enjoy 2 say battery life average shade better iphone 8 3 additional touch would support would good alternative unlocking optionwill come detailed review soon couple week","metaCorpus_processed":"ktron space grey 256 gb amazing beast iphone x 256 gb discount thank appario retail private ltd get 256 gb beast amazon great indian sale 80k additionally receive cash back rs 1000 delivery check imei24 apple site checkcoverage authenticity warranty product satisfied product 100 genuine iphone buttery smooth full screen awesome experience personally love notch give character phone no matter much hate design seem quite thing almost phone manufacturer start copy apple detractor apple notch take chill pill pros1 a11 bionic processor blaze fast couple 3 gb ram never issue heavy duty task throw it2 screen resolution super retina hd contrast ratio make view experience breathtaking3 get a1865 model iphone x a1865 use qualcomm mdm9655 snapdragon x16 lte modem iphone x a1901 intel xmm 7480 modem good a1901 model a1865 cover cellular band gsm cdma network frequency performance qualcomms chip always good intel lte speed cellular reception case weak signal also shade better a1901 cons1 glass body make susceptible breakage recommend case around preferably transparent one beauty original phone still enjoy 2 say battery life average shade better iphone 8 3 additional touch would support would good alternative unlocking optionwill come detailed review soon couple week","Sentiment":1.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-11-02","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Battery charging is very bad in my new iPhone X","ReviewDescription":"I ordered new iPhone X grey on Amazon sale. Phone looks absolutely fine but battery is very weak though it has fast charging option my phone requires 4-5 hours to get charged completely n also my phone is very slow.. feels like I have got a refurbished phone. Guys plz never go for online when u r purchasing costly phones. I have done a mistake u think before doing.","title_processed":"battery charging bad new iphone x","desc_processed":"order new iphone x grey amazon sale phone look absolutely fine battery weak though fast charge option phone require 4 5 hour get charge completely n also phone slow feel like get refurbish phone guy plz never go online u r purchase costly phone mistake u think","metaCorpus_processed":"amazon customer space grey 64 gb battery charging bad new iphone x order new iphone x grey amazon sale phone look absolutely fine battery weak though fast charge option phone require 4 5 hour get charge completely n also phone slow feel like get refurbish phone guy plz never go online u r purchase costly phone mistake u think","Sentiment":-1.0},{"Reviewer":"Amritpal Singh","DateOfReview":"2018-10-24","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Shame don't buy","ReviewDescription":"Apple iPhone X (Space Grey, 3GB RAM, 64GB Storage)Poor quality productDidn’t turn on at all after unboxingSHAME and waste of money","title_processed":"shame not buy","desc_processed":"apple iphone x space grey 3 gb ram 64 gb storage poor quality productdidnt turn unboxingshame waste money","metaCorpus_processed":"amritpal singh space grey 64 gb shame not buy apple iphone x space grey 3 gb ram 64 gb storage poor quality productdidnt turn unboxingshame waste money","Sentiment":1.0},{"Reviewer":"Abha Tiwari","DateOfReview":"2018-11-08","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"The Best Device ! All i need is my Iphone.","ReviewDescription":"What a pleasure to own iphonex. I bought it when it was launched. Checking today ...the price has dropped a 10K. Almost a year since my last upgrade. I do not compare phones. And I DO NOT compare them with Iphones. I think it is undeserving. Just saying. The camera is major on this one. The portrait mode is ace! I have the space grey in 64Gb and that's pretty much all the technical details I need. I'm one of those fortunate buyers who has the dough to spend on Apple products while residing in India so I don't really need to sit and debate with other people about why an X,Y,Z brand is better. I think Apple IS the best. Looks, functionality and everything. It does test the depth of your pockets and I think that's the only mark that there is and therefore it doesn't need comparing with other nondescript ones. I have never had any complains with any of my iphones in the past. This is my fourth upgrade. As a girl , it fulfils on the following categories - Good looks, Good looks & Good Looks. So grateful to Apple. So grateful to Amazon & so grateful to the seller. Thank you.","title_processed":"good device need iphone","desc_processed":"pleasure iphonex buy launch check today price drop 10k almost year since last upgrade not compare phone not compare iphone think undeserv say camera major one portrait mode ace space grey 64 gb pretty much technical detail need one fortunate buyer dough spend apple product reside india not really need sit debate people x z brand good think apple good look functionality everything test depth pocket think mark therefore not need compare nondescript one never complain iphone past fourth upgrade girl fulfil follow category good look good look good look grateful apple grateful amazon grateful seller thank","metaCorpus_processed":"abha tiwari space grey 64 gb good device need iphone pleasure iphonex buy launch check today price drop 10k almost year since last upgrade not compare phone not compare iphone think undeserv say camera major one portrait mode ace space grey 64 gb pretty much technical detail need one fortunate buyer dough spend apple product reside india not really need sit debate people x z brand good think apple good look functionality everything test depth pocket think mark therefore not need compare nondescript one never complain iphone past fourth upgrade girl fulfil follow category good look good look good look grateful apple grateful amazon grateful seller thank","Sentiment":1.0},{"Reviewer":"Prabhandh Reddy","DateOfReview":"2018-10-27","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Bad product (BUT GOOD SERVICE FROM AMAZON)😊","ReviewDescription":"Got a defective phone .... phone receiver not working very often problem started on the next day of delivery .... have to restart the phone evry time....Have contacted apple support they suggested me some setting and resets.... but that helped only for 1day....evn after software update also same issue, receiver not working(cannot hear the other person on call)I have gone through websites and i found thousands of people will defective speakers n receivers on their iphone xAMAZON IS GIVING ME A REPLACEMENT FOR THE PHONETHANK YOU AMAZON","title_processed":"bad product good service amazon","desc_processed":"get defective phone phone receiver not work often problem start next day delivery restart phone evry time contact apple support suggest setting reset help 1day evn software update also issue receiver not work not hear person call go website find thousand people defective speaker n receiver iphone xamazon give replacement phonethank amazon","metaCorpus_processed":"prabhandh reddy space grey 64 gb bad product good service amazon get defective phone phone receiver not work often problem start next day delivery restart phone evry time contact apple support suggest setting reset help 1day evn software update also issue receiver not work not hear person call go website find thousand people defective speaker n receiver iphone xamazon give replacement phonethank amazon","Sentiment":-1.0},{"Reviewer":"Deepak","DateOfReview":"2018-10-25","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Iphone was not in working condition","ReviewDescription":"I had a worst experience in purchasing Iphone X. Iphone never switched on after unboxing. After talking to amazon executive I had to submit phone to apple service centre. Amazon disnot even replaced my phone.","title_processed":"iphone not work condition","desc_processed":"bad experience purchase iphone x iphone never switch unbox talk amazon executive submit phone apple service centre amazon disnot even replace phone","metaCorpus_processed":"deepak space grey 64 gb iphone not work condition bad experience purchase iphone x iphone never switch unbox talk amazon executive submit phone apple service centre amazon disnot even replace phone","Sentiment":-1.0},{"Reviewer":"Priyanka negi","DateOfReview":"2019-01-15","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":3.0,"ReviewTitle":"Not satisfied","ReviewDescription":"In this image something is at the back cover. The product i got nothing is written in that y is it so plz tell","title_processed":"not satisfied","desc_processed":"image something back cover product get nothing write plz tell","metaCorpus_processed":"priyanka negi silver 64 gb not satisfied image something back cover product get nothing write plz tell","Sentiment":0.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-10-22","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"US adapter, not indian","ReviewDescription":"Comes with the wrong adapter. Otherwise a nice phone.","title_processed":"us adapter not indian","desc_processed":"come wrong adapter otherwise nice phone","metaCorpus_processed":"amazon customer space grey 256 gb us adapter not indian come wrong adapter otherwise nice phone","Sentiment":-1.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-10-31","Colour":" Silver ","Size":" 256GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Amazon Return support is too poor","ReviewDescription":"I purchased iphone X on 26th Oct'18 and started using from 28th Oct'18. When i received the product, it was already opened which i informed Amazon representative but i was told that it is original product and it will not have issue. Within two days, it started giving me issue with network & WiFi connectivity. I again contacted Amazon through app but i was directed to Apple support. After talking to Apple representative, i only got indefinite answer like it could be software issue and i should wait till it updates but Amazon return\/replace policy valid for only 10 days. After purchasing a phone worth up to 90k, i had to do all this and still no support from Amazon.","title_processed":"amazon return support poor","desc_processed":"purchase iphone x 26th oct18 start use 28th oct18 receive product already open inform amazon representative tell original product not issue within two day start give issue network wifi connectivity contact amazon app direct apple support talk apple representative get indefinite answer like could software issue wait till update amazon return replace policy valid 10 day purchase phone worth 90k still no support amazon","metaCorpus_processed":"amazon customer silver 256 gb amazon return support poor purchase iphone x 26th oct18 start use 28th oct18 receive product already open inform amazon representative tell original product not issue within two day start give issue network wifi connectivity contact amazon app direct apple support talk apple representative get indefinite answer like could software issue wait till update amazon return replace policy valid 10 day purchase phone worth 90k still no support amazon","Sentiment":-1.0},{"Reviewer":"ShowrobDa","DateOfReview":"2018-10-12","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"An amazing deal at INR 69,999\/-","ReviewDescription":"This is my 3rd iPhone after iPhone 4S and iPhone 6S Plus.Being an utter working middle class guy, I don't switch my iPhones very often (my android phones barely lasted me 9 months though). I do consider them extremely expensive, and I wouldn't go for one, unless I felt it was worth the money I was paying for it.Pros:- I got this phone for INR 69,999\/- from Amazon. With exchange offer, it cost me a little over 60K. For the price (and that price only), this makes it worth the buy.- It may not be the latest and greatest, but compared to iPhone XR, this is a much better package overall. Considering the XR is now priced higher than X. XS is only marginally better, and didn't feel it was worth the extra 30K.- Even after a year of being on the market, this phone is an absolute beast in terms of performance, especially after iOS 12.- The Camera is a beauty. You can't compare with DSLRs, but it is right up there with OnePlus and Google phones.- Looks exactly like the XS, and doesn't even have the S badging. So no one will be the wiser.Cons:- The delivery was a bit of a hassle. I had opted for One Day Delivery, at my work address. The agent reached at 7:30 in the morning, when I was obviously not at work. He did say he will come later in the afternoon. However, received the phone a day later.- The phone is extremely slippery. Invest in a good case, front screen protector and a rear glass protector- Such expensive phones should come with 128GB of storage as base, instead of 64GB. If you record 4K videos, it will eat up your storage really quickly.- Videos get heavily cropped when watching in full screen mode. If you have the money, go for XS Max.- The battery isn't the best. Takes over two hours to fully charge from 5% to 100% even with the iPad charger. With moderate usage, you can get 8 hours barely.- With the price of the phone, should have at least come with the fast charger in the box.","title_processed":"amazing deal inr 69999","desc_processed":"3rd iphone iphone 4s iphone 6s plus utter work middle class guy not switch iphone often android phone barely last 9 month though consider extremely expensive would not go one unless feel worth money pay pros get phone inr 69999 amazon exchange offer cost little 60k price price make worth buy may not late great compare iphone xr much good package overall consider xr price high x xs marginally good not feel worth extra 30k even year market phone absolute beast term performance especially ios 12 camera beauty not compare dslr right oneplus google phone look exactly like xs not even badging no one wise cons delivery bit hassle opt one day delivery work address agent reach 730 morning obviously not work say come later afternoon however receive phone day later phone extremely slippery invest good case front screen protector rear glass protector expensive phone come 128 gb storage base instead 64 gb record 4k video eat storage really quickly video get heavily crop watch full screen mode money go xs max battery not good take two hour fully charge 5 100 even ipad charger moderate usage get 8 hour barely price phone least come fast charger box","metaCorpus_processed":"showrobda space grey 64 gb amazing deal inr 69999 3rd iphone iphone 4s iphone 6s plus utter work middle class guy not switch iphone often android phone barely last 9 month though consider extremely expensive would not go one unless feel worth money pay pros get phone inr 69999 amazon exchange offer cost little 60k price price make worth buy may not late great compare iphone xr much good package overall consider xr price high x xs marginally good not feel worth extra 30k even year market phone absolute beast term performance especially ios 12 camera beauty not compare dslr right oneplus google phone look exactly like xs not even badging no one wise cons delivery bit hassle opt one day delivery work address agent reach 730 morning obviously not work say come later afternoon however receive phone day later phone extremely slippery invest good case front screen protector rear glass protector expensive phone come 128 gb storage base instead 64 gb record 4k video eat storage really quickly video get heavily crop watch full screen mode money go xs max battery not good take two hour fully charge 5 100 even ipad charger moderate usage get 8 hour barely price phone least come fast charger box","Sentiment":1.0},{"Reviewer":"Ktron","DateOfReview":"2018-10-11","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Amazing beast(iPhone X 256 GB) for discount!!","ReviewDescription":"Thanks to Appario Retail Private Ltd, I got this 256 GB beast during amazon great Indian sale for under 80k. Additionally received cash back of Rs.1000. On delivery, I checked at imei24 and apple site  (checkcoverage) for authenticity and warranty of the product. I was satisfied as the product was 100% genuine.iPhone is buttery smooth and the full screen is an awesome experience. Personally, I love the notch as it gives character to the phone. No matter how much you hate the design it seems this is quite an \"IN\" thing now for almost all phone manufacturers have started copying Apple. So all you detractors out there of Apple and the notch - take a chill pill :)!!Pros:1) A11 Bionic Processor is blazing fast and coupled with 3GB ram you will never have any issues with any of the heavy duty tasks you throw at it2) Screen resolution (Super retina HD) and the contrast ratio makes the viewing experience breathtaking3) Got the A1865 model ( iPhone X A1865 uses the Qualcomm MDM9655 Snapdragon X16 LTE modem while the iPhone X A1901 has the Intel XMM 7480 modem) which is better than the A1901 model as A1865 covers more cellular bands (GSM and CDMA networks and frequencies) and the performance of Qualcomm’s chips has always been better than Intel’s. LTE speeds and cellular receptions in case of weak signals also are a shade better than A1901.Cons:1) All glass body makes this susceptible to breakage. So recommend having a case around it (preferably a transparent one so that the beauty of the original phone can still be enjoyed!)2) I have to say that battery life is average - a shade better than iPhone 8.3) Additional touch id support would have been better as an alternative unlocking optionWill come up with a detailed review soon in a couple of weeks.","title_processed":"amazing beast iphone x 256 gb discount","desc_processed":"thank appario retail private ltd get 256 gb beast amazon great indian sale 80k additionally receive cash back rs 1000 delivery check imei24 apple site checkcoverage authenticity warranty product satisfied product 100 genuine iphone buttery smooth full screen awesome experience personally love notch give character phone no matter much hate design seem quite thing almost phone manufacturer start copy apple detractor apple notch take chill pill pros1 a11 bionic processor blaze fast couple 3 gb ram never issue heavy duty task throw it2 screen resolution super retina hd contrast ratio make view experience breathtaking3 get a1865 model iphone x a1865 use qualcomm mdm9655 snapdragon x16 lte modem iphone x a1901 intel xmm 7480 modem good a1901 model a1865 cover cellular band gsm cdma network frequency performance qualcomms chip always good intel lte speed cellular reception case weak signal also shade better a1901 cons1 glass body make susceptible breakage recommend case around preferably transparent one beauty original phone still enjoy 2 say battery life average shade better iphone 8 3 additional touch would support would good alternative unlocking optionwill come detailed review soon couple week","metaCorpus_processed":"ktron space grey 256 gb amazing beast iphone x 256 gb discount thank appario retail private ltd get 256 gb beast amazon great indian sale 80k additionally receive cash back rs 1000 delivery check imei24 apple site checkcoverage authenticity warranty product satisfied product 100 genuine iphone buttery smooth full screen awesome experience personally love notch give character phone no matter much hate design seem quite thing almost phone manufacturer start copy apple detractor apple notch take chill pill pros1 a11 bionic processor blaze fast couple 3 gb ram never issue heavy duty task throw it2 screen resolution super retina hd contrast ratio make view experience breathtaking3 get a1865 model iphone x a1865 use qualcomm mdm9655 snapdragon x16 lte modem iphone x a1901 intel xmm 7480 modem good a1901 model a1865 cover cellular band gsm cdma network frequency performance qualcomms chip always good intel lte speed cellular reception case weak signal also shade better a1901 cons1 glass body make susceptible breakage recommend case around preferably transparent one beauty original phone still enjoy 2 say battery life average shade better iphone 8 3 additional touch would support would good alternative unlocking optionwill come detailed review soon couple week","Sentiment":1.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-11-02","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Battery charging is very bad in my new iPhone X","ReviewDescription":"I ordered new iPhone X grey on Amazon sale. Phone looks absolutely fine but battery is very weak though it has fast charging option my phone requires 4-5 hours to get charged completely n also my phone is very slow.. feels like I have got a refurbished phone. Guys plz never go for online when u r purchasing costly phones. I have done a mistake u think before doing.","title_processed":"battery charging bad new iphone x","desc_processed":"order new iphone x grey amazon sale phone look absolutely fine battery weak though fast charge option phone require 4 5 hour get charge completely n also phone slow feel like get refurbish phone guy plz never go online u r purchase costly phone mistake u think","metaCorpus_processed":"amazon customer space grey 64 gb battery charging bad new iphone x order new iphone x grey amazon sale phone look absolutely fine battery weak though fast charge option phone require 4 5 hour get charge completely n also phone slow feel like get refurbish phone guy plz never go online u r purchase costly phone mistake u think","Sentiment":-1.0},{"Reviewer":"Amritpal Singh","DateOfReview":"2018-10-24","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Shame don't buy","ReviewDescription":"Apple iPhone X (Space Grey, 3GB RAM, 64GB Storage)Poor quality productDidn’t turn on at all after unboxingSHAME and waste of money","title_processed":"shame not buy","desc_processed":"apple iphone x space grey 3 gb ram 64 gb storage poor quality productdidnt turn unboxingshame waste money","metaCorpus_processed":"amritpal singh space grey 64 gb shame not buy apple iphone x space grey 3 gb ram 64 gb storage poor quality productdidnt turn unboxingshame waste money","Sentiment":1.0},{"Reviewer":"Abha Tiwari","DateOfReview":"2018-11-08","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"The Best Device ! All i need is my Iphone.","ReviewDescription":"What a pleasure to own iphonex. I bought it when it was launched. Checking today ...the price has dropped a 10K. Almost a year since my last upgrade. I do not compare phones. And I DO NOT compare them with Iphones. I think it is undeserving. Just saying. The camera is major on this one. The portrait mode is ace! I have the space grey in 64Gb and that's pretty much all the technical details I need. I'm one of those fortunate buyers who has the dough to spend on Apple products while residing in India so I don't really need to sit and debate with other people about why an X,Y,Z brand is better. I think Apple IS the best. Looks, functionality and everything. It does test the depth of your pockets and I think that's the only mark that there is and therefore it doesn't need comparing with other nondescript ones. I have never had any complains with any of my iphones in the past. This is my fourth upgrade. As a girl , it fulfils on the following categories - Good looks, Good looks & Good Looks. So grateful to Apple. So grateful to Amazon & so grateful to the seller. Thank you.","title_processed":"good device need iphone","desc_processed":"pleasure iphonex buy launch check today price drop 10k almost year since last upgrade not compare phone not compare iphone think undeserv say camera major one portrait mode ace space grey 64 gb pretty much technical detail need one fortunate buyer dough spend apple product reside india not really need sit debate people x z brand good think apple good look functionality everything test depth pocket think mark therefore not need compare nondescript one never complain iphone past fourth upgrade girl fulfil follow category good look good look good look grateful apple grateful amazon grateful seller thank","metaCorpus_processed":"abha tiwari space grey 64 gb good device need iphone pleasure iphonex buy launch check today price drop 10k almost year since last upgrade not compare phone not compare iphone think undeserv say camera major one portrait mode ace space grey 64 gb pretty much technical detail need one fortunate buyer dough spend apple product reside india not really need sit debate people x z brand good think apple good look functionality everything test depth pocket think mark therefore not need compare nondescript one never complain iphone past fourth upgrade girl fulfil follow category good look good look good look grateful apple grateful amazon grateful seller thank","Sentiment":1.0},{"Reviewer":"Prabhandh Reddy","DateOfReview":"2018-10-27","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Bad product (BUT GOOD SERVICE FROM AMAZON)😊","ReviewDescription":"Got a defective phone .... phone receiver not working very often problem started on the next day of delivery .... have to restart the phone evry time....Have contacted apple support they suggested me some setting and resets.... but that helped only for 1day....evn after software update also same issue, receiver not working(cannot hear the other person on call)I have gone through websites and i found thousands of people will defective speakers n receivers on their iphone xAMAZON IS GIVING ME A REPLACEMENT FOR THE PHONETHANK YOU AMAZON","title_processed":"bad product good service amazon","desc_processed":"get defective phone phone receiver not work often problem start next day delivery restart phone evry time contact apple support suggest setting reset help 1day evn software update also issue receiver not work not hear person call go website find thousand people defective speaker n receiver iphone xamazon give replacement phonethank amazon","metaCorpus_processed":"prabhandh reddy space grey 64 gb bad product good service amazon get defective phone phone receiver not work often problem start next day delivery restart phone evry time contact apple support suggest setting reset help 1day evn software update also issue receiver not work not hear person call go website find thousand people defective speaker n receiver iphone xamazon give replacement phonethank amazon","Sentiment":-1.0},{"Reviewer":"Deepak","DateOfReview":"2018-10-25","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Iphone was not in working condition","ReviewDescription":"I had a worst experience in purchasing Iphone X. Iphone never switched on after unboxing. After talking to amazon executive I had to submit phone to apple service centre. Amazon disnot even replaced my phone.","title_processed":"iphone not work condition","desc_processed":"bad experience purchase iphone x iphone never switch unbox talk amazon executive submit phone apple service centre amazon disnot even replace phone","metaCorpus_processed":"deepak space grey 64 gb iphone not work condition bad experience purchase iphone x iphone never switch unbox talk amazon executive submit phone apple service centre amazon disnot even replace phone","Sentiment":-1.0},{"Reviewer":"Priyanka negi","DateOfReview":"2019-01-15","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":3.0,"ReviewTitle":"Not satisfied","ReviewDescription":"In this image something is at the back cover. The product i got nothing is written in that y is it so plz tell","title_processed":"not satisfied","desc_processed":"image something back cover product get nothing write plz tell","metaCorpus_processed":"priyanka negi silver 64 gb not satisfied image something back cover product get nothing write plz tell","Sentiment":0.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-10-22","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"US adapter, not indian","ReviewDescription":"Comes with the wrong adapter. Otherwise a nice phone.","title_processed":"us adapter not indian","desc_processed":"come wrong adapter otherwise nice phone","metaCorpus_processed":"amazon customer space grey 256 gb us adapter not indian come wrong adapter otherwise nice phone","Sentiment":-1.0},{"Reviewer":"Jagadeesh v","DateOfReview":"2018-10-11","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":4.0,"ReviewTitle":"Heating, US model(without engraving at back)","ReviewDescription":"Everybody's aware of specs and pros, cons on a brief level of IphoneX. Let me put this one on perspective.Phone heats when charged and while using camera.Looks good but very slippery recommend a case whilst purchasing.As per most observations by critics, Silver looks better than grey.","title_processed":"heating us model without engrave back","desc_processed":"everybody aware spec pro con brief level iphonex let put one perspective phone heat charge use camera look good slippery recommend case whilst purchasing per observation critic silver look good grey","metaCorpus_processed":"jagadeesh v silver 64 gb heating us model without engrave back everybodys aware spec pro con brief level iphonex let put one perspective phone heat charge use camera look good slippery recommend case whilst purchasing per observation critic silver look good grey","Sentiment":1.0},{"Reviewer":"S VISHNU VARDHAN REDDY","DateOfReview":"2018-11-26","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Product is not working properly","ReviewDescription":"Facing lot of problems whithin 3 days it is not working and they replaced with another item unfortunately this also not working properly. Kindly help me to come out from of it","title_processed":"product not work properly","desc_processed":"face lot problem whithin 3 day not work replace another item unfortunately also not work properly kindly help come","metaCorpus_processed":"vishnu vardhan reddy silver 64 gb product not work properly face lot problem whithin 3 day not work replace another item unfortunately also not work properly kindly help come","Sentiment":-1.0},{"Reviewer":"Dr P Kishore","DateOfReview":"2018-10-16","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Replacement of the defective item","ReviewDescription":"There is a pink linear line on the screen. Inspected by authorised service personnel and advised to replace the item.","title_processed":"replacement defective item","desc_processed":"pink linear line screen inspect authorised service personnel advise replace item","metaCorpus_processed":"dr p kishore space grey 256 gb replacement defective item pink linear line screen inspect authorised service personnel advise replace item","Sentiment":1.0},{"Reviewer":"HateAmazon","DateOfReview":"2018-10-28","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Looks nice and premium.","ReviewDescription":"Looks really nice and premium. Price is very high and one should wait for offer season to get it around effective price of 65k or bellow. For look and feel, i do not think any other mobile can come closer in current period.","title_processed":"look nice premium","desc_processed":"look really nice premium price high one wait offer season get around effective price 65k bellow look feel not think mobile come closer current period","metaCorpus_processed":"hateamazon silver 64 gb look nice premium look really nice premium price high one wait offer season get around effective price 65k bellow look feel not think mobile come closer current period","Sentiment":1.0},{"Reviewer":"SATYANARAYAN MISHRA","DateOfReview":"2018-10-23","Colour":" Silver ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Iphone X 264gb at 71500... Steal Deal for an Iphone.","ReviewDescription":"The biggest pro for me is its battery. Thats something I was always concious on Android S8, S7 Edge,All Oneplus devices till op6. On same usage IPhoneX comfortably saves me more than 20%. Thats a clincher for me. And I got this 256gb at effective price of 70k Approx. Thanks to Amazon.","title_processed":"iphone x 264 gb 71500 steal deal iphone","desc_processed":"big pro battery something always concious android s8 s7 edge oneplus device till op6 usage iphonex comfortably save 20 clincher get 256 gb effective price 70k approx thank amazon","metaCorpus_processed":"satyanarayan mishra silver 256 gb iphone x 264 gb 71500 steal deal iphone big pro battery something always concious android s8 s7 edge oneplus device till op6 usage iphonex comfortably save 20 clincher get 256 gb effective price 70k approx thank amazon","Sentiment":1.0},{"Reviewer":"Avinash Baghel","DateOfReview":"2018-10-12","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"iPhone like never before","ReviewDescription":"Amazing phone waited for a year and finally got this is Amazon Great Indian festival at unbelievable price.Quality as always on top of all phones in market, cannot compare with any other phones.Amazon delivery is awesome got in one day.Many Many thanks to Amazon.","title_processed":"iphone like never","desc_processed":"amazing phone wait year finally get amazon great indian festival unbelievable price quality always top phone market not compare phone amazon delivery awesome get one day many many thank amazon","metaCorpus_processed":"avinash baghel space grey 256 gb iphone like never amazing phone wait year finally get amazon great indian festival unbelievable price quality always top phone market not compare phone amazon delivery awesome get one day many many thank amazon","Sentiment":-1.0},{"Reviewer":"Gaurav bisht","DateOfReview":"2018-12-02","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Iphone X - Better phone to buy in 2018 & 2019","ReviewDescription":"I was confused between Iphone X and Iphone XR but finally made decision to buy iphone X due to its best in class design and components. I have used Iphone 5s in past still it works like a charm. I bought this device during amazon sale at 62K and it is really value for money deal.Its been 2 month didn't face any type of issues & moreover having - 120 Hz touch-sensing capability the screen is really buttery smooth. Go for Iphone X blindly as Iphone XS & XR are just copy of X with few advancements that doesn't make much difference.","title_processed":"iphone x good phone buy 2018 2019","desc_processed":"confuse iphone x iphone xr finally make decision buy iphone x due good class design component use iphone 5s past still work like charm buy device amazon sale 62k really value money deal 2 month not face type issue moreover 120 hz touch sense capability screen really buttery smooth go iphone x blindly iphone xs xr copy x advancement not make much difference","metaCorpus_processed":"gaurav bisht silver 64 gb iphone x good phone buy 2018 2019 confuse iphone x iphone xr finally make decision buy iphone x due good class design component use iphone 5s past still work like charm buy device amazon sale 62k really value money deal 2 month not face type issue moreover 120 hz touch sense capability screen really buttery smooth go iphone x blindly iphone xs xr copy x advancement not make much difference","Sentiment":1.0},{"Reviewer":"Ron Mukherjee","DateOfReview":"2018-10-25","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Received a phone with scratch on screen","ReviewDescription":"Never noticed but received the product with a very light scratch on screen.","title_processed":"receive phone scratch screen","desc_processed":"never notice receive product light scratch screen","metaCorpus_processed":"ron mukherjee silver 64 gb receive phone scratch screen never notice receive product light scratch screen","Sentiment":0.0},{"Reviewer":"Ashish Gupta","DateOfReview":"2018-10-12","Colour":" Silver ","Size":" 256GB","VerifiedPurchase":true,"Rating":4.0,"ReviewTitle":"Awesome phone with small disappointments","ReviewDescription":"The phone is simply awesome- The display, the smoothness, the feel in the hand is so premium.But what really annoys is lack of Fast charger and its cable is Cheap quality. Pricing is always an issue with apple. But the phone is really awesome. Accessories are on cheaper side quality wise.Needs protection to the most as any breakage will cost you a huge amount.One thing more- The packaging of the phone was pathetic. Didn't expect this from amazon. Cheap quality packing.","title_processed":"awesome phone small disappointment","desc_processed":"phone simply awesome display smoothness feel hand premium really annoy lack fast charger cable cheap quality pricing always issue apple phone really awesome accessory cheap side quality wise need protection breakage cost huge amount one thing packaging phone pathetic not expect amazon cheap quality packing","metaCorpus_processed":"ashish gupta silver 256 gb awesome phone small disappointment phone simply awesome display smoothness feel hand premium really annoy lack fast charger cable cheap quality pricing always issue apple phone really awesome accessory cheap side quality wise need protection breakage cost huge amount one thing packaging phone pathetic not expect amazon cheap quality packing","Sentiment":1.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-12-05","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Iohonx","ReviewDescription":"It's bad  experience from Amazon ,after one month phone totally reboot and start after automatically and so.much heat problem facing ..customer service centre only reset phone only nothing to do ....this is Amazon ....really???","title_processed":"iohonx","desc_processed":"bad experience amazon one month phone totally reboot start automatically much heat problem face customer service centre reset phone nothing amazon really","metaCorpus_processed":"amazon customer space grey 64 gb iohonx bad experience amazon one month phone totally reboot start automatically much heat problem face customer service centre reset phone nothing amazon really","Sentiment":1.0},{"Reviewer":"Jay Sangani","DateOfReview":"2018-11-12","Colour":" Silver ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Thank you Amazon for the amazing deal","ReviewDescription":"Found the perfect deal during the Great Indian Festival. I thought the deal was too good to be true and was expecting a cancellation of order from the seller. But the day I received the order was epic. The phone is simply superb. Everything about the phone is perfect....hey what do expect from an Apple product. Good battery life, durable with screen protector and case and screen quality is excellent. Thank you Amazon","title_processed":"thank amazon amazing deal","desc_processed":"find perfect deal great indian festival think deal good true expect cancellation order seller day receive order epic phone simply superb everything phone perfect hey expect apple product good battery life durable screen protector case screen quality excellent thank amazon","metaCorpus_processed":"jay sangani silver 256 gb thank amazon amazing deal find perfect deal great indian festival think deal good true expect cancellation order seller day receive order epic phone simply superb everything phone perfect hey expect apple product good battery life durable screen protector case screen quality excellent thank amazon","Sentiment":1.0},{"Reviewer":"Gaurav Gautam","DateOfReview":"2018-11-09","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Well it's Apple","ReviewDescription":"This pjone is lit. I gifted it to my sister cause i am not huge on iOS but this one certainly impressed me. After just 20 minutes of exposure i learnt all the gestures and found myself doing them on my V20. Its expensive yes but it feels like it was meant for thos price tag.Well done Apple.PS I didn't like the front camera. Everything else is impressive.","title_processed":"well apple","desc_processed":"pjone light gift sister not huge ios one certainly impress 20 minute exposure learn gesture find v20 expensive yes feel like mean thos price tag well apple ps not like front camera everything else impressive","metaCorpus_processed":"gaurav gautam space grey 64 gb well apple pjone light gift sister not huge ios one certainly impress 20 minute exposure learn gesture find v20 expensive yes feel like mean thos price tag well apple ps not like front camera everything else impressive","Sentiment":1.0},{"Reviewer":"Rajeev Seth","DateOfReview":"2019-01-14","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Iphone x","ReviewDescription":"Received the box intact.After unboxing the phone, i found the volume button sticky( non functional) and voice quality of the speaker was not upto mark.I approached b2x for the problem same day i received the phone.B2x replaced the phone in 7 days.Thanks to b2x for the same.But i wasnt expecting this kind of product from amazon.","title_processed":"iphone x","desc_processed":"receive box intact unbox phone find volume button sticky non functional voice quality speaker not upto mark approach b2x problem day receive phone b2x replace phone 7 day thank b2x not expect kind product amazon","metaCorpus_processed":"rajeev seth silver 64 gb iphone x receive box intact unbox phone find volume button sticky non functional voice quality speaker not upto mark approach b2x problem day receive phone b2x replace phone 7 day thank b2x not expect kind product amazon","Sentiment":-1.0},{"Reviewer":"Sushant S.","DateOfReview":"2018-12-12","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":2.0,"ReviewTitle":"Genuine review by heart","ReviewDescription":"The battery life was better than previous iphones but can't take the competition from other phone available in the market it gives you one day(15 hrs approx) backup with moderate usage, it catches scratch very easily specially on its metal rim, screen was awesome, sound is also superb, camera is not upto mark, too much heating issues after upgrading ios 12.1.Not a value for money. Too much expensive.","title_processed":"genuine review heart","desc_processed":"battery life good previous iphone not take competition phone available market give one day 15 hrs approx backup moderate usage catch scratch easily specially metal rim screen awesome sound also superb camera not upto mark much heating issue upgrade ios 12 1 not value money much expensive","metaCorpus_processed":"sushant space grey 64 gb genuine review heart battery life good previous iphone not take competition phone available market give one day 15 hrs approx backup moderate usage catch scratch easily specially metal rim screen awesome sound also superb camera not upto mark much heating issue upgrade ios 12 1 not value money much expensive","Sentiment":-1.0},{"Reviewer":"Amit Pratap Singh","DateOfReview":"2018-11-04","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Good experience.","ReviewDescription":"I had an iphone 6s, i wanted to upgrade it so i thought to give it a try and i think it was a good idea. Screen is large and the notch. I love it.","title_processed":"good experience","desc_processed":"iphone 6s want upgrade think give try think good idea screen large notch love","metaCorpus_processed":"amit pratap singh silver 64 gb good experience iphone 6s want upgrade think give try think good idea screen large notch love","Sentiment":1.0},{"Reviewer":"KUNAL DOGRA","DateOfReview":"2019-01-16","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Great just great","ReviewDescription":"This is my first iphone i was a long time android user but after using this iphone my views have been completely changed for androids after using ios or iphone i have realised that iphone is  much better than android in terms of display,camera,speed the iphone works seamless i mean the speed is very goodThe battery is okay if you  dont play games the battery will run for a whole day in a single charge2-The camera is mind  blowing3- the phone processor speed is greatCons1- the battery drains fast when you play games or if you keep bright display light then also battery will not be able to keep it for a whole day","title_processed":"great great","desc_processed":"first iphone long time android user use iphone view completely change android use ios iphone realise iphone much good android term display camera speed iphone work seamless mean speed goodthe battery okay not play game battery run whole day single charge2the camera mind blowing3 phone processor speed greatcons1 battery drain fast play game keep bright display light also battery not able keep whole day","metaCorpus_processed":"kunal dogra silver 64 gb great great first iphone long time android user use iphone view completely change android use ios iphone realise iphone much good android term display camera speed iphone work seamless mean speed goodthe battery okay not play game battery run whole day single charge2the camera mind blowing3 phone processor speed greatcons1 battery drain fast play game keep bright display light also battery not able keep whole day","Sentiment":-1.0},{"Reviewer":"Amazon Customer","DateOfReview":"2018-10-19","Colour":" Space Grey ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Got at 68k","ReviewDescription":"Got at 68k","title_processed":"get 68k","desc_processed":"get 68k","metaCorpus_processed":"amazon customer space grey 64 gb get 68k get 68k","Sentiment":1.0},{"Reviewer":"Milind Ahuja","DateOfReview":"2018-11-27","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Worth the purchase","ReviewDescription":"My first ever iphone and this much expensive purchase from Amazon and i was literally doubtful if i should purchase this online. Now its been almost 1 month that i am using this (thanks amazon for the wonderful delivery and the seller Appario retail pvt ltd for building the trust) and trust me its worth every penny. I got an authentic product with earphones, charger and a connector, you can check it as well on imei24 and official apple website. It feels so premium in hands and very handy as compared to other latest phones. Yes i agree its very expensive but its worth it. I was a android user till now and i wanted a change so i decided for iphone X and i think i will be an apple user for life now lol. It will take you some time to explore the features as it is much different from Android but it's fun. Face recognition works like a charm and overall it is really fast so 3GB works same like the 8 GB RAM on the other phones.. Camera take the real and natural pictures with beautiful colors without fake filters and all. It is much more secure than the android phones. Battery backup might not be the best but its not that bad as well.Overall i would say its a great product and if you are bored from using andorid and need a change and also if you love luxury, Go for this.First month went really good, let's see how will be experience in coming months, i might change my review accordingly then lol.","title_processed":"worth purchase","desc_processed":"first ever iphone much expensive purchase amazon literally doubtful purchase online almost 1 month use thank amazon wonderful delivery seller appario retail pvt ltd build trust trust worth every penny get authentic product earphone charger connector check well imei24 official apple website feel premium hand handy compare late phone yes agree expensive worth android user till want change decide iphone x think apple user life lol take time explore feature much different android fun face recognition work like charm overall really fast 3 gb work like 8 gb ram phone camera take real natural picture beautiful color without fake filter much secure android phone battery backup may not good not bad well overall would say great product bored use andorid need change also love luxury go first month go really good let us see experience coming month may change review accordingly lol","metaCorpus_processed":"milind ahuja silver 64 gb worth purchase first ever iphone much expensive purchase amazon literally doubtful purchase online almost 1 month use thank amazon wonderful delivery seller appario retail pvt ltd build trust trust worth every penny get authentic product earphone charger connector check well imei24 official apple website feel premium hand handy compare late phone yes agree expensive worth android user till want change decide iphone x think apple user life lol take time explore feature much different android fun face recognition work like charm overall really fast 3 gb work like 8 gb ram phone camera take real natural picture beautiful color without fake filter much secure android phone battery backup may not good not bad well overall would say great product bored use andorid need change also love luxury go first month go really good let us see experience coming month may change review accordingly lol","Sentiment":0.0},{"Reviewer":"Manish Mittal","DateOfReview":"2019-02-02","Colour":" Silver ","Size":" 64GB","VerifiedPurchase":true,"Rating":1.0,"ReviewTitle":"Defective software. Doesn't load appstore.. Very sorry support by B2X Apple service center, Delhi","ReviewDescription":"Very annoying purchase. There is no appstore on the device. Took it to Apple service center in Ansal plaza Delhi, the day after purchase. They couldn't fix it. They were supposed to call me with a fix but they never did.  The apple call center in Gujarat didnt have the Ansal plaza store number. My email to the service center went unanswered ( i have proof). Today i went to Apple service center again and they loaded appstore but when I brought home and refreshed the OS, it's gone again.  Unfortunately, now realized the return window is over. Can't believe I am stuck with a INR 75,000 lemon. This cant be the way to support such an expensive product by Apple in India. Atrocious.. I am hoping Apple folks read this and do the right thing by replacing my device or refunding the money!!","title_processed":"defective software not load appstore sorry support b2x apple service center delhi","desc_processed":"annoying purchase no appstore device take apple service center ansal plaza delhi day purchase could not fix suppose call fix never apple call center gujarat not ansal plaza store number email service center go unanswered proof today go apple service center load appstore bring home refresh os go unfortunately realize return window not believe stick inr 75000 lemon not way support expensive product apple india atrocious hop apple folk read right thing replace device refund money","metaCorpus_processed":"manish mittal silver 64 gb defective software not load appstore sorry support b2x apple service center delhi annoying purchase no appstore device take apple service center ansal plaza delhi day purchase could not fix suppose call fix never apple call center gujarat not ansal plaza store number email service center go unanswered proof today go apple service center load appstore bring home refresh os go unfortunately realize return window not believe stick inr 75000 lemon not way support expensive product apple india atrocious hop apple folk read right thing replace device refund money","Sentiment":-1.0},{"Reviewer":"Syed","DateOfReview":"2018-10-29","Colour":" Space Grey ","Size":" 256GB","VerifiedPurchase":true,"Rating":5.0,"ReviewTitle":"Truly a phone which will leave an impression","ReviewDescription":"Apple has always been a coin with 2 sides, it has loyal followers who will swear by it and it has loyal critics who will feed of it. Now coming to the iPhone X. I will be speaking only about the phone and it’s features and not compare with other models.Pros-- Its  truly a beautiful phone. The notch in the top is something I feel u will want to have once u start using it.- the build quality is amazing. It’s a premium phone from the get go. Once u open the box, it’s like opening a Pandora’s box, something truly befitting a flagship.(of course it’s an year old now)- the screen resolution is just crisp and jaw dropping. Unlike its predecessors, the screen is gorgeous. Colours are spot on, the True Tone display needs some time to get used to but later there’s no turning back to the normal mode. The colours, no matter the time of the day, sunlight , no light, moonlight, tube light or what ever, always great.-the camera is very good being a dual camera and all and the pictures are pretty good, although I am not a avid mobile photographer.-the size of the phone is just right. At least for me it seems a good fit. Although sometimes 2 hands are required for some tasks but overall one handed most of the time.- Face ID- this is where it gets tricky. The phone unlocks with Face ID or a passcode. Now I have tried this feature with a beard , dim lighting , night times and many possible scenarios, and I must say , it’s good. Although it’s takes a few milliseconds more in low lighting, but over all good. (PS NOTE- there is no finger print unlock !!!!!!!)- The phone is truly fast. Multitasking, heavy gaming, anything is like a walk in the park for the phone. It’s truly a beast with it processing speed. Doesn’t warm up even when doing multiple tasks or playing PUBG. You have to understand that apple uses its RAM in a different way, so 3gb RAM may seem little on paper but don’t let numbers fool you.Cons-- battery life - now the battery life for the average usage is good but for gaming and heavy usage I feel is a bit disappointing. Could have been better, but hey, that’s what power banks are there for.- headphone jack- this is truly frustrating sometimes!!!! I mean come on!!!!! Who will manufacture Bose or sony  or beats headphones with a lighting cable!!!!!!!! U will have to carry the connector all the time or leave it attached to ur headphones all the time to avoid forgetting them in a hurry.These are just a few points I have noticed after using the phone for sometime, will update if I feel anything is needed.","title_processed":"truly phone leave impression","desc_processed":"apple always coin 2 side loyal follower swear loyal critic feed come iphone x speak phone feature not compare model pros truly beautiful phone notch top something feel u want u start use build quality amazing premium phone get go u open box like open pandora box something truly befit flagship course year old screen resolution crisp jaw dropping unlike predecessor screen gorgeous colour spot true tone display need time get use later no turn back normal mode colour no matter time day sunlight no light moonlight tube light ever always great camera good dual camera picture pretty good although not avid mobile photographer size phone right least seem good fit although sometimes 2 hand require task overall one hand time face id get tricky phone unlock face would passcode try feature beard dim lighting night time many possible scenario must say good although take millisecond low lighting good ps note no finger print unlock phone truly fast multitask heavy gaming anything like walk park phone truly beast process speed not warm even multiple task playing pubg understand apple use ram different way 3 gb ram may seem little paper not let number fool cons battery life battery life average usage good gaming heavy usage feel bit disappointing could good hey power bank headphone jack truly frustrating sometimes mean come manufacture bose sony beat headphone lighting cable u carry connector time leave attach ur headphone time avoid forget hurry point notice use phone sometime update feel anything need","metaCorpus_processed":"sy space grey 256 gb truly phone leave impression apple always coin 2 side loyal follower swear loyal critic feed come iphone x speak phone feature not compare model pros truly beautiful phone notch top something feel u want u start use build quality amazing premium phone get go u open box like open pandora box something truly befit flagship course year old screen resolution crisp jaw dropping unlike predecessor screen gorgeous colour spot true tone display need time get use later no turn back normal mode colour no matter time day sunlight no light moonlight tube light ever always great camera good dual camera picture pretty good although not avid mobile photographer size phone right least seem good fit although sometimes 2 hand require task overall one hand time face id get tricky phone unlock face would passcode try feature beard dim lighting night time many possible scenario must say good although take millisecond low lighting good ps note no finger print unlock phone truly fast multitask heavy gaming anything like walk park phone truly beast process speed not warm even multiple task playing pubg understand apple use ram different way 3 gb ram may seem little paper not let number fool cons battery life battery life average usage good gaming heavy usage feel bit disappointing could good hey power bank headphone jack truly frustrating sometimes mean come manufacture bose sony beat headphone lighting cable u carry connector time leave attach ur headphone time avoid forget hurry point notice use phone sometime update feel anything need","Sentiment":1.0}]